"""Сумма простых чисел меньше 10 равна 2 + 3 + 5 + 7 = 17.

Найдите сумму всех простых чисел меньше двух миллионов."""
n = 2000000
x = 0
arr = list(range(2, n))

while arr[x] ** 2 < n:
    arr = arr[:x + 1] + [i for i in arr[x+1:] if i % arr[x] != 0]
    x += 1

print(sum(arr))
